[
  {
    "year": 1978,
    "title": "The Birth of Sikka Cleaners",
    "description": "Sikka Cleaners was founded in 1978 by Hiraben and Shankarbhai, with a vision to provide top-quality laundry and dry-cleaning services. Our first service center was established at Vijay Cross Road, Ahmedabad, marking the beginning of our journey toward excellence in fabric care."
  },
  {
    "year": 2001,
    "title": "Expansion to Memnagar, Ahmedabad",
    "description": "After 23 years of expertise in the dry-cleaning industry, Sikka Cleaners expanded its reach by opening a second branch in Memnagar, Ahmedabad. This milestone marked our commitment to providing exceptional laundry and dry-cleaning services to a broader customer base."
  },
  {
    "year": 2008,
    "title": "Expanding Beyond Gujarat to Udaipur, Rajasthan",
    "description": "Building on years of success, Sikka Cleaners took a significant step forward in 2008 by expanding beyond Ahmedabad. We established our third branch in Udaipur, Rajasthan, marking our presence in a new state and bringing our trusted laundry and dry-cleaning services to a wider audience."
  },
  {
    "year": 2009,
    "title": "Sikka Cleaners Goes Online",
    "description": "With a passion for innovation and technology, Mr. Dineshkumar took a bold step in 2009 by launching the official Sikka Cleaners website. This move marked our entry into the digital space, making it easier for customers to access our services online and stay connected with us."
  },
  {
    "year": 2013,
    "title": "Expansion to Naranpura, Ahmedabad",
    "description": "Driven by our commitment to quality service and customer satisfaction, Sikka Cleaners continued to grow. In 2013, we proudly opened our fourth branch in Naranpura, Ahmedabad, further expanding our reach and bringing premium laundry and dry-cleaning services to more customers."
  },
  {
    "year": 2018,
    "title": "Innovation with a Smart System & Mega Plant",
    "description": "In 2018, Sikka Cleaners took a major leap forward by planning the establishment of a state-of-the-art Mega Plant in an industrial area. This facility was designed to centralize all services under one roof, integrating advanced technology and smart systems to enhance efficiency, quality, and customer satisfaction."
  },
  {
    "year": 2020,
    "title": "Launch of the Mega Plant with Smart Systems",
    "description": "In 2020, Sikka Cleaners achieved a major milestone by establishing a state-of-the-art Mega Plant in an industrial area. This cutting-edge facility brings all our services under one roof, integrating smart systems and advanced technology to enhance efficiency, quality, and customer experience."
  },
  {
    "year": 2025,
    "title": "New Branch on Science City Road & Technological Advancements",
    "description": "At the beginning of 2025, Sikka Cleaners expanded its reach by opening a new branch on Science City Road, further enhancing our service coverage. To elevate efficiency and quality, we also introduced heavy-duty equipment at our workshop, embracing a high-tech approach to garment processing."
  }
]
